[{"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": 1, "children": [{"kind": "t3", "data": {"domain": "self.district0x", "approved_at_utc": null, "mod_reason_by": null, "banned_by": null, "subreddit_id": "t5_3lzh8", "thumbnail_width": null, "subreddit": "district0x", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m sure I&amp;#39;ve seen this somewhere, just cant remember where. Is there a deadline as to when someone can vote? Example.&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;Token holder votes to take part in MonkeyJoes AutoShop. Is there a voting deadline? 1wk? 24hrs? &lt;/li&gt;\n&lt;li&gt;Also, if there is a deadline and it passed, can the token holder still vote on anything that MonkeyJoes does at a later date? &lt;/li&gt;\n&lt;li&gt;Last thing. If a user submits a proposal and its built by District0x, does District0x and the user automatically have voting rights to the district? &lt;/li&gt;\n&lt;li&gt;I lied ha ha ha, here&amp;#39;s the last thing. How much does 1 DNT equal as far as voting? Does 1 DNT equal 50 votes, etc?&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;Thank you for your time. &lt;/p&gt;\n\n&lt;p&gt;#ToTheMoon #MyDistrictIsBetterThanYours #LAMBO #ICantStopHashTagging [Someone needs to create a district that allows hashtag ownership ha ha ha ]&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm sure I've seen this somewhere, just cant remember where. Is there a deadline as to when someone can vote? Example.\n\n1. Token holder votes to take part in MonkeyJoes AutoShop. Is there a voting deadline? 1wk? 24hrs? \n2. Also, if there is a deadline and it passed, can the token holder still vote on anything that MonkeyJoes does at a later date? \n3. Last thing. If a user submits a proposal and its built by District0x, does District0x and the user automatically have voting rights to the district? \n4. I lied ha ha ha, here's the last thing. How much does 1 DNT equal as far as voting? Does 1 DNT equal 50 votes, etc?\n\nThank you for your time. \n\n\n #ToTheMoon #MyDistrictIsBetterThanYours #LAMBO #ICantStopHashTagging [Someone needs to create a district that allows hashtag ownership ha ha ha ]\n\n ", "likes": null, "suggested_sort": null, "mod_note": null, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "link_flair_text": null, "id": "7rde9t", "banned_at_utc": null, "mod_reason_title": null, "view_count": null, "archived": false, "clicked": false, "report_reasons": null, "author": "HumanIAmNot", "num_crossposts": 0, "saved": false, "can_mod_post": false, "is_crosspostable": false, "pinned": false, "score": 6, "approved_by": null, "over_18": false, "removal_reason": null, "hidden": false, "num_comments": 1, "thumbnail": "self", "hide_score": false, "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "contest_mode": false, "gilded": 0, "locked": false, "downs": 0, "brand_safe": false, "secure_media_embed": {}, "media_embed": {}, "can_gild": false, "thumbnail_height": null, "parent_whitelist_status": null, "name": "t3_7rde9t", "spoiler": false, "permalink": "/r/district0x/comments/7rde9t/can_votes_take_place_after_voting/", "subreddit_type": "public", "whitelist_status": null, "stickied": false, "created": 1516341965.0, "url": "https://www.reddit.com/r/district0x/comments/7rde9t/can_votes_take_place_after_voting/", "author_flair_text": null, "quarantine": false, "title": "Can Votes Take Place After Voting?", "created_utc": 1516313165.0, "subreddit_name_prefixed": "r/district0x", "distinguished": null, "media": null, "upvote_ratio": 1.0, "mod_reports": [], "is_self": true, "visited": false, "num_reports": null, "is_video": false, "ups": 6}}], "before": null}}, {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_3lzh8", "approved_at_utc": null, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_7rde9t", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "dsw5aot", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "Bradymck", "can_mod_post": false, "ups": 4, "parent_id": "t3_7rde9t", "score": 4, "approved_by": null, "downs": 0, "body": "**One**. There is no deadline at the moment because we are a little way away from building a community submitted district. \n\n---\n\n**Two**. We will announce a deadline to voting on the first community submitted proposal though no ETA right now. As far as voting on the district progress on a granular scale after being voted in, that is undecided. \nHowever we have done this with the districts we are launching internally using a similar voting app as the district one. Though a number of the community submitted districts do have a dedicated development team that will be involved in launching as a district. So it's ultimately up to them as to how that works. \n\n---\n\n**Three**. Similar to my previous comment, a lot of this will be up to the district creator and people building the market initially. Some may give more options to govern than others, its hard to say at this point because this is externally decided. Though considering the open nature of the tools we're using it will likely be quite open in many ways. Though decentralized governance is not something to be taken lightly, incentive alignment needs to be structured in a way that ensures the stability of the market. So as far as giving anyone \"automatic voting rights\", that needs to be thought about thoroughly. I personally think we will see something closer to a meritocracy type system based on reputation and engagement to ensure malicious actors can't co-opt a market before it even gets going. \n\n---\n\n**Four**. In very simple terms it's basically 1 token one vote, though that is understating the depth of governance structures we will see. You may have a million DNT to stake and influence a district, though that district may have a governance module that requires you to stake reputation as well as have a seat as a delegate in a liquid democracy type structure or meritocracy module. So it's hard to say that it's 1 DNT 1 vote. This will also be quite different district to district because of the modular nature of Aragon.  ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;One&lt;/strong&gt;. There is no deadline at the moment because we are a little way away from building a community submitted district. &lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&lt;strong&gt;Two&lt;/strong&gt;. We will announce a deadline to voting on the first community submitted proposal though no ETA right now. As far as voting on the district progress on a granular scale after being voted in, that is undecided. \nHowever we have done this with the districts we are launching internally using a similar voting app as the district one. Though a number of the community submitted districts do have a dedicated development team that will be involved in launching as a district. So it&amp;#39;s ultimately up to them as to how that works. &lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&lt;strong&gt;Three&lt;/strong&gt;. Similar to my previous comment, a lot of this will be up to the district creator and people building the market initially. Some may give more options to govern than others, its hard to say at this point because this is externally decided. Though considering the open nature of the tools we&amp;#39;re using it will likely be quite open in many ways. Though decentralized governance is not something to be taken lightly, incentive alignment needs to be structured in a way that ensures the stability of the market. So as far as giving anyone &amp;quot;automatic voting rights&amp;quot;, that needs to be thought about thoroughly. I personally think we will see something closer to a meritocracy type system based on reputation and engagement to ensure malicious actors can&amp;#39;t co-opt a market before it even gets going. &lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&lt;strong&gt;Four&lt;/strong&gt;. In very simple terms it&amp;#39;s basically 1 token one vote, though that is understating the depth of governance structures we will see. You may have a million DNT to stake and influence a district, though that district may have a governance module that requires you to stake reputation as well as have a seat as a delegate in a liquid democracy type structure or meritocracy module. So it&amp;#39;s hard to say that it&amp;#39;s 1 DNT 1 vote. This will also be quite different district to district because of the modular nature of Aragon.  &lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "subreddit_type": "public", "can_gild": true, "subreddit": "district0x", "score_hidden": false, "permalink": "/r/district0x/comments/7rde9t/can_votes_take_place_after_voting/dsw5aot/", "num_reports": null, "name": "t1_dsw5aot", "created": 1516345964.0, "author_flair_text": null, "created_utc": 1516317164.0, "subreddit_name_prefixed": "r/district0x", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}]